[
	{
		"id": 1,
		"name": "Arthur",
		"series": "gng",
		"description": "A fearless knight faced with fending off legions of the undead and supernatural creatures. Journeying to defeat the demon lords and save Princess Guinevere, when beating the final boss, its often an illusion. He usually has to beat the final boss twice.",
		"firstAppeared": "Ghosts n' Goblins",
		"cameos": "Fights in Marvel vs Capcom 3."
	},
	{
		"id": 2,
		"name": "Nemesis",
		"series": "resi",
		"description": ".",
		"firstAppeared": "Resident Evil 3",
		"cameos": "Fights in Marvel vs Capcom 3."
	},
	{
		"id": 3,
		"name": "Akuma",
		"series": "sf",
		"description": "In order to learn the technique of the Raging Demon, Akuma embraced the evil power of the Satsui no Hadou. Through the technique, Akuma gave up any compassion he held towards other human beings and became extremely powerful.",
		"firstAppeared": "Street Fighter 2",
		"cameos": "As a playable character in Tekken 7."
	},
	{
		"id": 4,
		"name": "Wesker",
		"series": "resi",
		"description": "A bioweapons researcher and assassin, Wesker is a master manipulator. He formed a police unit in Raccoon City as an opportunity to gather battle data by pitting his unit's members against zombies and bioweapons.",
		"firstAppeared": "Resident Evil",
		"cameos": "His costume is available in Street Fighter 5."
	},
	{
		"id": 5,
		"name": "Rose",
		"series": "sf",
		"description": "An Italian fortune teller who wields a mysterious form of energy known as Soul Power. She tries to help Ryu overcome the dark power in him that consumed Akuma and warns him of the people who would stop at nothing to get this power.",
		"firstAppeared": "Street Fighter Alpha",
		"cameos": "Appears as a boss in Street Fighter X Megaman."
	},
	{
		"id": 6,
		"name": "Zero",
		"series": "megaman",
		"description": "A robot defending the world from Sigma, he enlists the help of Megaman X. More powerful in many ways, he sets the standard for the hero Megaman X can become.",
		"firstAppeared": "Megaman X",
		"cameos": "Fighting in Marvel vs Capcom 3. Regarded as 1st of top tier by pros."
	},
	{
		"id": 7,
		"name": "M Bison",
		"series": "sf",
		"description": "A self-imposed dictator and megalomaniac seeking world domination. As the founder and leader of Shadaloo, he uses drug trafficking, arms dealing, terrorism and illegal human experimentation to achieve his goals. He wields his deadly Psycho Power to great effect, dominating others in battle.",
		"firstAppeared": "Street Fighter 2",
		"cameos": "Riding a sled in Super Gem Fighter."
	},

	{
		"id": 8,
		"name": "Regina",
		"series": "dinocrisis",
		"description": "An intelligence agent for S.O.R.T, she is tasked with investigating a research lab which turned out to be reviving dinosaurs. She fought to survive and chased down the lab's scientist Dr Kirk. ",
		"firstAppeared": "Dino Crisis",
		"cameos": "Playable in Namco X Capcom."
	},
	{
		"id": 9,
		"name": "Ada",
		"series": "resi",
		"description": "A mysterious American woman of Chinese descent, Ada is a cunning and formidable secret agent. During Raccoon City, her mission was to find a virus sample for an Umbrella corp rival. There she met Leon and adopted a fake identity to use him for her own ends. After he saved her life, however, she started to help him in his missions.",
		"firstAppeared": "Resident Evil 2",
		"cameos": "In Chapter 9 of Project X Zone."
	},
	{
		"id": 10,
		"name": "BB Hood",
		"series": "darkstalkers",
		"description": "Although she has a cute and innocent appearance, B.B. Hood is a murderous psychopath. As a Darkhunter, she kills Darkstalkers for money. She intentionally pretends to act like a defenseless girl, and many of her attacks are intentionally deceptive to look accidental.",
		"firstAppeared": "Vampire Savior",
		"cameos": "Fights in Marvel vs Capcom 2."
	},
	{
		"id": 11,
		"name": "Dudley",
		"series": "sf",
		"description": "Dudley is an English boxer who was born into a wealthy English family. However when his father lost the family fortune, he took up professional boxing. He eventually won back the assets through his speed and skill.",
		"firstAppeared": "Street Fighter 3",
		"cameos": "In the background of the Capcom vs SNK 2 London stage."
	},
	{
		"id": 12,
		"name": "Phoenix Wright",
		"series": "aceattorney",
		"description": "Phoenix Wright is a veteran defense attorney who heads the Wright Anything Agency. Mostly specializing in criminal trials, Wright is renowned for his ability to turn seemingly hopeless cases around.",
		"firstAppeared": "Ace Attorney",
		"cameos": "Fights in Marvel vs Capcom 3."
	},
	{
		"id": 13,
		"name": "Ken",
		"series": "sf",
		"description": "Similar to his longtime best friend and rival Ryu, Ken's goal is to test his power against many different fighters and strives to become stronger, but holds more restraint due to not wanting to jeopardize his family life.",
		"firstAppeared": "Street Fighter 2",
		"cameos": "Fights in Super Smash Bros Ultimate."
	},
	{
		"id": 14,
		"name": "Bishamon",
		"series": "darkstalkers",
		"description": "A cursed samurai who dons the demonic armor Hannya and uses the blood thirsty sword Kien, the demonic artifacts. He endlessly searches for sacrifices in battle.",
		"firstAppeared": "Darkstalkers",
		"cameos": "On a card in SNK vs Capcom Card Fighter."
	},
	{
		"id": 15,
		"name": "Cammy",
		"series": "sf",
		"description": "She was at one time a deadly clone assassin that was working for Shadaloo before breaking free and becoming an MI6 operative for the British government. She vows to take out M Bison, who brainwashed her.",
		"firstAppeared": "Street Fighter 2",
		"cameos": "Fights in Street Fighter X Tekken."
	},
	{
		"id": 16,
		"name": "Captain Commando",
		"series": "commando",
		"description": "The year is 2026. The world is filled with crime. Captain Commando and his three faithful Commando Companions rise up to erase this crime from Planet Earth and from all the Galaxy.",
		"firstAppeared": "Captain Commando",
		"cameos": "Fights in Marvel vs Capcom 2."
	},
	{
		"id": 17,
		"name": "Jin",
		"series": "cyberbots",
		"description": "The pilot of the Variant Armor BX-02 BLODIA. To honor the memory of his deceased pilot father, he descends to Earth from a space colony and seeks to become the best Variant Armor pilot alive to prove his worth through the VA battle circuit.",
		"firstAppeared": "Cyberbots: Full Metal Madness",
		"cameos": "Fights in person in Marvel vs Capcom 2."
	},
	{
		"id": 18,
		"name": "R Mika",
		"series": "sf",
		"description": "Since childhood, 'Rainbow' Mika dreamed of becoming a star in Japanese professional wrestling. She thought of the perfect marketing gimmick to promote herself: traveling the world and engaging in random matches with street fighters.",
		"firstAppeared": "Street Fighter Alpha",
		"cameos": "On a billboard in Street Fighter 4."
	},
	{
		"id": 19,
		"name": "Dan",
		"series": "sf",
		"description": "An overconfident self-taught martial artist determined to run a dojo for his Saikyo style. He almost had his first student in Sakura, but after learning his moves in a month, she found them quite stupid.",
		"firstAppeared": "Street Fighter Alpha",
		"cameos": "Fights in Super Gem Fighter."
	},
	{
		"id": 20,
		"name": "Dante",
		"series": "dmc",
		"description": "The second son of the demon Sparda and the human Eva, Dante is a paranormal mercenary, private investigator and vigilante Devil Hunter dedicated to exterminating evil demons and other malevolent supernatural forces.",
		"firstAppeared": "Devil May Cry",
		"cameos": "As an extra character in Viewtiful Joe."
	},
	{
		"id": 21,
		"name": "Morrigan",
		"series": "darkstalkers",
		"description": "Morrigan is a succubus and a powerful princess of the demon realm Makai, who lives for the excitement of battle. She found her life as a sheltered princess in the Aensland castle dull, so she frequently visited the human world to look for entertainment.",
		"firstAppeared": "Darkstalkers",
		"cameos": "Playable in Super Puzzle Fighter."
	},
	{
		"id": 22,
		"name": "Devilotte",
		"series": "cyberbots",
		"description": "Daughter of a dangerous and reputed pirate king, she flies around space looking for people with Variant Armors to steal them and add to her collection. She pilots the S-008 Super-8, a mecha in the shape of an octopus that she uses to attack other pilots.",
		"firstAppeared": "Cyberbots: Full Metal Madness",
		"cameos": "Playable in Super Puzzle Fighter."
	},
	{
		"id": 23,
		"name": "Dhalsim",
		"series": "sf",
		"description": "A pacifist who goes against his beliefs by entering the World Warrior tournament to raise money for his poor village. He has the unique ability to stretch his arms, legs, abdomen and even his neck to great lengths.",
		"firstAppeared": "Street Fighter 2",
		"cameos": "A boss in Street Fighter x Megaman."
	},
	{
		"id": 24,
		"name": "Wily",
		"series": "megaman",
		"description": "A mad scientist who aspires to conquer the world with his robot army lead by his 8 Robot Masters. His rival Dr Light built Megaman in the hope of defeating the army.",
		"firstAppeared": "Megaman",
		"cameos": "A boss in Adventure Quiz: Capcom World."
	},
	{
		"id": 25,
		"name": "Mike Haggar",
		"series": "finalfight",
		"description": "Elected as mayor of Metro City, he vows to clean up its streets. However, the powerful Mad Gear Gang has other ideas, and eventually Haggar's daughter Jessica is kidnapped to ensure his cooperation. Instead he takes takes the fight to the Mad Gears with Jessica's boyfriend Cody and martial artist Guy.",
		"firstAppeared": "Final Fight",
		"cameos": "Fights in Marvel vs Capcom 3."
	},
	{
		"id": 26,
		"name": "Guy",
		"series": "finalfight",
		"description": "A martial artist in Metro City, he takes on the powerful Mad Gear Gang with Mayor Mike Haggar and Cody. Born of Japanese ancestry, once the city is safe he returns there to train. When the Mad Gears return to Metro, so does Guy.",
		"firstAppeared": "Final Fight",
		"cameos": "Playable in Street Fighter from Alpha onwards."
	},
	{
		"id": 27,
		"name": "Ryu",
		"series": "sf",
		"description": "An experienced martial artist, highly focused on his training, aiming to become the strongest he can. He always travels, looking for the toughest challengers to test his skills.",
		"firstAppeared": "Street Fighter",
		"cameos": "Playable in Super Smash Bros."
	},
	{
		"id": 28,
		"name": "Donovan",
		"series": "darkstalkers",
		"description": "A half human, half vampire who killed everyone in his village as child when his power awakened. Trying to overcome his cursed blood, he devoted his life to justice and began training to hunt any Darkstalkers who attack the innocent.",
		"firstAppeared": "Darkstalkers",
		"cameos": "Playable in Super Puzzle Fighter."
	},
	{
		"id": 29,
		"name": "Q Bee",
		"series": "darkstalkers",
		"description": "The leader of the Soul Bee race, a race that eats souls to live. The Soul Bees are subordinates of Jedah Dohma not out of loyalty, but because he plans to invade other realms. New realms means more souls for the Soul Bees to feed on.",
		"firstAppeared": "Vampire Savior",
		"cameos": "Appears in both Felicia's and Jedah's endings in Capcom Fighting Evolution."
	},
	{
		"id": 30,
		"name": "Nelo",
		"series": "dmc",
		"description": "Nelo Angelo is a demon created by the enslavement and reconstruction of Dante's deceased brother Vergil. Capable of teleporting great distances and possessing a powerful sword, he repeatedly attempts to kill his brother in an unrecognisable form.",
		"firstAppeared": "Devil May Cry",
		"cameos": "In Viewtiful Joe as an extra costume."
	},
	{
		"id": 31,
		"name": "Franziska von Karma",
		"series": "aceattorney",
		"description": "Franziska von Karma is a prosecuting attorney and the daughter of the late veteran prosecutor Manfred von Karma. Feeling overwhelming pressure from her father's reputation, she took the bar exam at 13 and earned a reputation as a prodigy.",
		"firstAppeared": "Ace Attorney - Justice For All",
		"cameos": "As a power up card in Marvel vs Capcom 3."
	},
	{
		"id": 32,
		"name": "Gill",
		"series": "sf",
		"description": "A powerful cult leader capable of resurrection in battle. His cult uses kidnapping, coercion, DNA manipulation, brainwashing, and extreme force to achieve its goals. Possessing cryo and pyro kinetic abilities, his body releases fire and ice at will.",
		"firstAppeared": "Street Fighter 3",
		"cameos": "As a skin in Minecraft."
	},
	{
		"id": 33,
		"name": "Mia Fey",
		"series": "aceattorney",
		"description": "Phoenix Wright's boss and mentor, she left her firm to him after her death at the hands of Redd White. Her younger sister Maya served as Wright's assistant during his law career, and would sometimes use her spirit channeling abilities to allow Mia to assist Wright.",
		"firstAppeared": "Ace Attorney",
		"cameos": "On a card in Capcom vs SNK Card Fighters."
	},
	{
		"id": 34,
		"name": "Guile",
		"series": "aceattorney",
		"description": "A Colonel in the United States Air Force whose goal is to destroy the criminal organization Shadaloo. He despises Shadoloo's leader M Bison for his crimes against humanity and holds him responsible for the demise of his friend Charlie.",
		"firstAppeared": "Street Fighter 2",
		"cameos": "As an Assist Trophy in Super Smash Bros."
	},
	{
		"id": 35,
		"name": "Hayato",
		"series": "plasmasword",
		"description": "Hayato is an intergalactic bounty hunter born in an orphanage. Joining the Star Gladiator project, he learned to fight with a powerful lazer sword and protected Earth against the Forth Empire.",
		"firstAppeared": "Star Gladiator",
		"cameos": "Fights in Marvel vs Capcom 2"
	},
	{
		"id": 36,
		"name": "Hsien Ko",
		"series": "darkstalkers",
		"description": "Formerly human, she used the Igyo Tenshin technique to turn into a Jiang-Shi, a unique zombie from Asia. She uses the form to free the soul of her mother from dark magic of darkstalkers.",
		"firstAppeared": "Darkstalkers",
		"cameos": "Fights in Super Puzzle Fighter"
	},
	{
		"id": 37,
		"name": "Hyo",
		"series": "rivalschools",
		"description": "A young sword fighter whose family is part of the 'Reverse Society', a society determined to take over the world. He manipulates the events in Rival Schools and is the true antagonist.",
		"firstAppeared": "Rival Schools",
		"cameos": "As a card in Card Fighters DS"
	},
	{
		"id": 38,
		"name": "Ibuki",
		"series": "sf",
		"description": "She has trained in the deadly art of ninjutsu since childhood. She sneaks away from her daily clan life compete in the World Warrior tournament, in order to meet cool and handsome guys.",
		"firstAppeared": "Street Fighter 3",
		"cameos": "Playable in Super Gem Fighter"
	},
	{
		"id": 39,
		"name": "Jedah",
		"series": "dstalkers",
		"description": "A 6000 year old demon lord who lives in a castle in the demon realm. His goal is to fuse all the souls he can into a divine fetus called Shintai. ",
		"firstAppeared": "Vampire Savior",
		"cameos": "Playable in Marvel vs Capcom Infinite"
	},
	{
		"id": 40,
		"name": "Jill",
		"series": "resi",
		"description": "Ex Raccoon police officer and BSAA agent. Having survived biohazardous outbreaks and fought off zombies and tyrants like Nemesis, she has a commitment to eradicating bioterrorism.",
		"firstAppeared": "Resident Evil 3",
		"cameos": "Playable in Marvel vs Capcom 3"
	},
	{
		"id": 41,
		"name": "Kyoko",
		"series": "rival schools",
		"description": "A popular school nurse from Justice High School. She is an expert in orthopedics and anatomy with the control and precision of a surgical genius.",
		"firstAppeared": "Rival Schools",
		"cameos": "Playable in Namco X Capcom"
	},
	{
		"id": 42,
		"name": "Kyosuke",
		"series": "rival schools",
		"description": "The brother of Hyo and part of the 'Reverse Society', he eventually turns on them to help students in Hyo's defeat. He eventually convinces him to change to a path of peace.",
		"firstAppeared": "Rival Schools",
		"cameos": "Playable in Capcom vs SNK 2"
	},
	{
		"id": 43,
		"name": "Leo",
		"series": "Red Earth",
		"description": "A king who is cursed, loses his kingdom and is transformed into a lion man by the dark wizard Scion. He fights to take his revenge on Scion and win back his kingdom.",
		"firstAppeared": "Red Earth",
		"cameos": "In a chair in front of a fireplace in Super Gem Fighter"
	},
	{
		"id": 44,
		"name": "Tessa",
		"series": "Red Earth",
		"description": "A sorceress looking to understand unnatural storms in her home country. She eventually finds Hydron is responsible, a general of the dark wizard Scion.",
		"firstAppeared": "Red Earth",
		"cameos": "Playable in Super Gem Fighter"
	},
	{
		"id": 45,
		"name": "Strider",
		"series": "Strider",
		"description": "A spy possessing superhuman abilities and extreme combat training from the government. He hunts Grandmaster Meio, a powerful military leader who has conquered the world.",
		"firstAppeared": "Strider",
		"cameos": "Playable in Marvel vs Capcom 2"
	},
	{
		"id": 46,
		"name": "Marionette",
		"series": "darkstalkers",
		"description": "A manipulative creature that possesses darkstalkers and other creatures to fight. Once an enemy is defeated, marionette leaves the victor in stone, before taking over the defeated creature.",
		"firstAppeared": "Vampire Savior",
		"cameos": "On a card in Card Fighter DS"
	},
	{
		"id": 47,
		"name": "Son Son",
		"series": "sonson",
		"description": "A manipulative creature that possesses darkstalkers and other creatures to fight. Once an enemy is defeated, marionette leaves the victor in stone, before taking over the new defeated creature.",
		"firstAppeared": "Son Son",
		"cameos": "Playable in Marvel vs Capcom 2"
	},
	{
		"id": 48,
		"name": "Megaman X",
		"series": "megaman",
		"description": "A robot given the ability to evolve by his creator Dr Light. When he defeats one of Sigma's robot masters, he can take the robot's main ability for himself.",
		"firstAppeared": "Megaman X",
		"cameos": "As a costume in Dead Rising"
	},
	{
		"id": 49,
		"name": "Edgeworth",
		"series": "aceattorney",
		"description": "Miles Edgeworth is a Chief Prosecutor of the prosecutor's office. During his first four years as a prosecutor, he had a perfect win record in trials until his is defeat in court by his childhood friend Phoenix Wright. His goal as a prosecutor is to seek the truth above all else, and to use the power of the law to save people.",
		"firstAppeared": "Ace Attorney",
		"cameos": "She Hulk's ending in Marvel vs Capcom 3"
	},
	{
		"id": 50,
		"name": "Red Arremer",
		"series": "gng",
		"description": "A member of the winged species that serves the ruler of the demon realm. Attacking aggressively with great speed and mobility, it can dodge almost any weapon thrown towards it.",
		"firstAppeared": "Ghost 'n Goblins",
		"cameos": "Playable in Marvel vs Capcom 3"
	}
]
